[
    {
        "id":"fallhaven_lytwings",
        "name":"It's Knot Funny",
        "showInLog":1,
        "stages":[
            {
                "progress":1,
                "logText":"I met Arensia in Fallhaven. She is being taunted by lytwings while she slumbers. I agreed to help get rid of the mischevious creatures. I should talk to Rigmor to find out more, she lives north of the tavern."
            },
            {
                "progress":10,
                "logText":"Rigmor told me that lytwings live near large rings of mushroom growth, I should look for these in the forest surrounding Fallhaven."
            },
            {
                "progress":11,
                "logText":"I have to take a gift of two red apples and two strawberries before I can talk to the lytwings. They cast some kind of spell on me for not bringing them these fruit, it made me feel very tired."
            },
            {
                "progress":12,
                "logText":"The lytwings accepted my gift, and I can now talk with them."
            },
            {
                "progress":13,
                "logText":"I offered my help to the lytwings in exchange for leaving Arensia alone. They are considering my request. I should check in with them shortly, to hear their decision."
            },
            {
                "progress":20,
                "logText":"The lytwings asked that I chop down a gnarly old tree that is inside their mushroom ring. They insisted that I use an iron axe because the cursed bark of the tree cannot be cut by other tools."
            },
            {
                "progress":21,
                "logText":"I was about to swing my axe, when the lytwings stopped me. They have changed their minds about chopping down the tree. I am beginnning to think they are indecisive on purpose."
            },
            {
                "progress":30,
                "logText":"The lytwings want four bottles of mead. I can probably find some at the Fallhaven tavern."
            },
            {
                "progress":31,
                "logText":"They took the mead, and turned around saying they want something else. I can now see why Rigmor said they are full of mischief! But I have no other choice but to continue this fool's errand, if I want to help Arensia."
            },
            {
                "progress":40,
                "logText":"I have to find twelve wild flowers for the lytwings. I wonder where I could find those. Perhaps Arensia will know."
            },
            {
                "progress":41,
                "logText":"They accepted the flowers, and as expected, said they want something else! How many more times will they make me run around?"
            },
            {
                "progress":90,
                "logText":"The lytwings want a token of Arensia's promise that she will not to pick their mushrooms again. I sense they are not playing another prank this time, they seemed intent about this task."
            },
            {
                "progress":91,
                "logText":"Arensia made a promise to her mother's ring, and then she gave it to me. I should take it to the lytwings at once."
            },
            {
                "progress":92,
                "logText":"I gave Arensia's ring to the lytwings. Just when I thought it was done, they said they need something else! I am waiting on their decision."
            },
            {
                "progress":99,
                "logText":"The lytwings have agreed to stop taunting Arensia. I should go tell her."
            },
            {
                "progress":100,
                "logText":"Arensia was elated to hear that the lytwings will no longer taunt her.",
                "rewardExperience":300,
                "finishesQuest":1
            },
            {
                "progress":101,
                "logText":"I could not take the absurd errands any more. I am no longer helping Arensia with her lytwing problem.",
                "finishesQuest":1
            },
            {
                "progress":102,
                "logText":"I lied to Arensia's and kept her mother's ring for myself.",
                "finishesQuest":1
            },
            {
                "progress":103,
                "logText":"Arensia gave me her magical promise ring as reward for helping her."
            }
        ]
    }
]